num1 = int(input('Введите целое число:'))  # пользователю необходимо ввести целое число
num2 = int(input('Введите целое число:'))  # пользователю необходимо ввести целое число
num3 = str(input('Введите строку:'))  # пользователю необходимо ввести слово
num4 = float(input('Введите дробное число:'))  # пользователю необходимо ввести дробное число
print(num1, num2, num3, num4)  # выводится решение на экран

a = 5  # переменная с типом данных числа
b = 3.7  # переменная с типом данных дробь
c = True  # переменная с типом данных логичским
d = 'Hi!'  # переменная с типом данных слово
a = str(a)  # деалем из числа слово
b = str(b)  # делаем из числа слово

name = str(input('введите имя: '))  # пользователь вводит своё имя
surname = str(input('введите фамилию: '))  # пользователь вводит свою фамилию
lastname = str(input('введите отчество: ')) # пользователь вводит своё отчество
age = int(input('введите возраст: ')) # пользователь вводит свой возраст
city = str(input('введите город проживания: ')) # пользователь вводит свой город
print(name, surname, lastname) # в первую строку выведет фио
print(age) # во вторую строку выведет возраст
print(city) # в третью строку выведет город
